/**
 * Reverse Engineered by TekuConcept on May 6, 2021
 */

#include "hi3516cv500-regmap.h"

#define REGU32(addr) *((unsigned int*)(addr))

#define EXE_SIZE 0x6000

#define FRAME_ENTER '\xFE'
#define FRAME_DATA  '\xDA'
#define FRAME_END   '\xED'

#define DOWN_MAGIC  0x444F574E /* "DOWN" */
#define ZIJU_MAGIC  0x7A696A75 /* "ziju" */
#define EMMC_MAGIC  0x454D4D43 /* "EMMC" */

typedef enum boot_type_t {
    BOOT_TYPE_SERIAL = 0x73616665, /* safe */
    BOOT_TYPE_EMMC   = 0x73616666, /* saff */
    BOOT_TYPE_SDIO   = 0x73616667, /* safg */
    BOOT_TYPE_USB    = 0x73616668, /* safh */
} boot_type_t;

typedef enum stream_state_t {
    STREAM_STATE_ACK    = 1,
    STREAM_STATE_ERROR  = 2,
    STREAM_STATE_IGNORE = 3,
    STREAM_STATE_DONE   = 4,
} stream_state_t;

typedef struct mem_block_t {
    unsigned short size;
    unsigned short count;
} mem_block_t;

typedef struct phy_mem_t {
    unsigned int blk_size;
    unsigned int blk_count;
    unsigned int phy_addr;
    unsigned int alloc_mask;
} phy_mem_t;

typedef struct crc_context_t { // (sizeof=0xC)
    unsigned short expected_checksum; // 0x00
    unsigned short actual_checksum;   // 0x02
    unsigned short count;             // 0x04
    unsigned char  data;              // 0x06
    unsigned char  reserved_byte;     // 0x07
    void*          memory;            // 0x08
} crc_context_t;

typedef struct program_stream_t { // (sizeof=0x1C)
    unsigned int data;         // 0x00
    unsigned int addr;         // 0x04
    unsigned int size;         // 0x08
    unsigned int total_frames; // 0x0C
    unsigned int count;        // 0x10
    unsigned int sequence;     // 0x14
    void (*callback)();        // 0x18
} program_stream_t;

typedef struct struc_4 {
    unsigned int field_0;  // 0x00 (assigned 0)
    char field_4;          // 0x04 (assigned -1)
    char field_5;          // 0x05 (assigned 0)
    char field_6;          // 0x06 (assigned 1)
    char field_7;          // 0x07
    unsigned int field_8;  // 0x08
    unsigned int field_C;  // 0x0C (likely blk_size)
    unsigned int field_10; // 0x10 (callback)
    unsigned int field_14; // 0x14
    unsigned int field_18; // 0x18
} struc_4;

typedef struct context_t { // (sizeof=0x268)
    unsigned int field_0;         // 0x000
    char field_4[12];             // 0x004 (relating to memory mapping)

    phy_mem_t memory_map[16];     // 0x010 (sizeof=0x100)

    unsigned int field_110;       // 0x110
    unsigned int field_160;       // 0x160 (relating to SDIO)
    void *mmc_phy_addr;           // 0x164

    unsigned int uart_base;       // 0x17C

    unsigned int time_value;      // 0x180
    unsigned int residual_time;   // 0x184
    unsigned int field_188;       // 0x188

} context_t;

context_t* g_context = (context_t*)SDRAM_START;


extern void enable_instruction_cache();       // offset=0x2858
extern void disable_instruction_cache();      // offset=0x2880
extern int invalidate_instruction_pipeline(); // offset=0x28E0


int // offset=0x3410
sub_3410()
{
    int v0; // r6
    int v1; // r0
    int v2; // r0
    unsigned int v3; // r4
    int v4; // r5
    int v5; // r0

    // UART0_RXD: slow level conversion, IO2_level3, pullup (0x531)
    REGU32(IO_CTRL1_START + 0x10) = 0x531;
    // UART0_TXD: slow level conversion, IO2_level3 (0x431)
    REGU32(IO_CTRL1_START + 0x14) = 0x431;

    v0 = 5;
    v1 = enable_uart();
    v2 = sub_3338(v1);
    v3 = 10 * sub_5244(v2);

    while ( 2 ) {
        v4 = 5;
        do {
            uart_send(32);
            --v4;
        } while ( v4 );

        timer_reset_counter();

        while ( v3 > timer_time_passed() ) {
