/**
 * Created by TekuConcept on April 12, 2021
 */

#include <stdio.h>
#include <unistd.h>
#include <fcntl.h>
#include <sys/stat.h>
#include <sys/ioctl.h>

#include "mpi_ae.h"
#include "mpi_awb.h"
#include "mpi_isp.h"
#include "hi_sns_ctrl.h"
#include "hi_debug.h"


HI_VOID cmos_get_inttime_max(VI_PIPE ViPipe, HI_U16 u16ManRatioEnable, HI_U32 *au32Ratio, HI_U32 *au32IntTimeMax, HI_U32 *au32IntTimeMin, HI_U32 *pu32LFMaxIntTime);
HI_S32 gc2053_set_bus_info(VI_PIPE ViPipe, ISP_SNS_COMMBUS_U unSNSBusInfo);
HI_S32 cmos_set_image_mode(VI_PIPE ViPipe, ISP_CMOS_SENSOR_IMAGE_MODE_S *pstSensorImageMode);
HI_VOID cmos_fps_set(VI_PIPE ViPipe, HI_FLOAT f32Fps, AE_SENSOR_DEFAULT_S *pstAeSnsDft);
inline HI_S32 sensor_ctx_init(VI_PIPE ViPipe);
HI_S32 sensor_register_callback(VI_PIPE ViPipe, ALG_LIB_S *pstAeLib, ALG_LIB_S *pstAwbLib);
HI_S32 cmos_get_sns_regs_info(VI_PIPE ViPipe, ISP_SNS_REGS_INFO_S *pstSnsRegsInfo);
HI_S32 cmos_get_isp_default(VI_PIPE ViPipe, ISP_CMOS_DEFAULT_S *pstDef);
HI_S32 cmos_get_awb_default(VI_PIPE ViPipe, AWB_SENSOR_DEFAULT_S *pstAwbSnsDft);
HI_S32 cmos_get_ae_default(VI_PIPE ViPipe, AE_SENSOR_DEFAULT_S *pstAeSnsDft);
HI_S32 sensor_set_init(VI_PIPE ViPipe, ISP_INIT_ATTR_S *pstInitAttr);
HI_VOID cmos_set_pixel_detect(HI_S32 ViPipe, HI_BOOL bEnable);
HI_S32 cmos_get_isp_black_level(VI_PIPE ViPipe, ISP_CMOS_BLACK_LEVEL_S *pstBlackLevel);
HI_VOID cmos_ae_fswdr_attr_set(VI_PIPE ViPipe, AE_FSWDR_ATTR_S *pstAeFSWDRAttr);
HI_VOID cmos_again_calc_table(VI_PIPE ViPipe, HI_U32 *pu32AgainLin, HI_U32 *pu32AgainDb);
HI_VOID cmos_gains_update(VI_PIPE ViPipe, HI_U32 u32Again, HI_U32 u32Dgain);
HI_VOID cmos_inttime_update(VI_PIPE ViPipe, HI_U32 u32IntTime);
HI_VOID cmos_slow_framerate_set(VI_PIPE ViPipe, HI_U32 u32FullLines, AE_SENSOR_DEFAULT_S *pstAeSnsDft);
HI_S32 sensor_unregister_callback(VI_PIPE ViPipe, ALG_LIB_S *pstAeLib, ALG_LIB_S *pstAwbLib);
HI_VOID sensor_global_init(VI_PIPE ViPipe);
HI_S32 cmos_set_wdr_mode(VI_PIPE ViPipe, HI_U8 u8Mode);
HI_S32 gc2053_i2c_init(VI_PIPE ViPipe);
HI_S32 gc2053_i2c_exit(VI_PIPE ViPipe);
HI_S32 gc2053_read_register(VI_PIPE ViPipe, HI_S32 s32Addr);
HI_S32 gc2053_write_register(VI_PIPE ViPipe, HI_S32 s32Addr, HI_S32 s32Data);
HI_VOID gc2053_standby(VI_PIPE ViPipe);
HI_VOID gc2053_restart(VI_PIPE ViPipe);
HI_VOID gc2053_mirror_flip(VI_PIPE ViPipe, ISP_SNS_MIRRORFLIP_TYPE_E enFlipType);
HI_VOID gc2053_exit(VI_PIPE ViPipe);
HI_S32 gc2053_linear_1080p30_init(VI_PIPE ViPipe);
HI_VOID gc2053_init(VI_PIPE ViPipe);


#define VI_PIPE_SIZE 4
#define HI_TRACE_SNS(fmt, ...)                                                                                     \
    do {                                                                                                           \
        HI_TRACE(HI_DBG_ERR, HI_ID_ISP, "[Func]:%s [Line]:%d [Info]:" fmt, __FUNCTION__, __LINE__, ##__VA_ARGS__); \
    } while (0)

typedef struct HiGC2053_S {
    HI_U32 field_0;                      // likely bEnabled
    HI_BOOL field_4;                     //
    HI_U8 u8SensorMode;                  // [field_8]
    HI_U8 field_9;                       //
    HI_U8 field_A;                       //
    HI_U8 field_B;                       //
    HI_U32 field_C;                      //
    ISP_SNS_REGS_INFO_S stIspRegsInfo_A; // [field_10]
    ISP_SNS_REGS_INFO_S stIspRegsInfo_B; // [field_430]
    HI_U32 u32FullLines;                 // [field_850]
    HI_U32 field_854;                    // likely u32FullLinesMax
    HI_U32 u32FullLinesStd;              // [field_858]
    HI_U64 field_85C;                    //
    HI_U64 field_864;                    //
    HI_U32 field_86C;                    //
    HI_U32 field_870;                    //
    HI_U32 field_874;                    //
    HI_U32 field_878;                    //
} GC2053_S;

ISP_SNS_COMMBUS_U g_aunGc2053BusInfo[VI_PIPE_SIZE];
GC2053_S* g_pastGc2053[VI_PIPE_SIZE];

AWB_AGC_TABLE_S g_stAwbAgcTable = {
    .bValid = HI_TRUE,
    .au8Saturation = {
        0x80, 0x78, 0x73, 0x6E,
        0x69, 0x5F, 0x58, 0x50,
        0x48, 0x40, 0x38, 0x38,
        0x38, 0x38, 0x38, 0x38
    }
};

ISP_CMOS_NOISE_CALIBRATION_S g_stIspNoiseCalibratio = {
    .u16CalibrationLutNum = 9,
    .afCalibrationCoef = {
        {   100.000000,     0.055957,     0.015088 },
        {   200.000000,     0.110440,     0.000000 },
        {   400.000000,     0.208750,     0.000000 },
        {   800.000000,     0.430600,     0.000000 },
        {  1600.000000,     0.868610,     0.000000 },
        {  3200.000000,     1.698800,     0.742000 },
        {  6400.000000,     3.371000,     4.415500 },
        { 12800.000000,     6.607100,    15.182000 },
        { 25600.000000,    12.531000,    58.288000 },
        {     0.000000,     0.000000,     0.000000 },
        {     0.000000,     0.000000,     0.000000 },
        {     0.000000,     0.000000,     0.000000 },
        {     0.000000,     0.000000,     0.000000 },
        {     0.000000,     0.000000,     0.000000 },
        {     0.000000,     0.000000,     0.000000 },
        {     0.000000,     0.000000,     0.000000 },
        {     0.000000,     0.000000,     0.000000 },
        {     0.000000,     0.000000,     0.000000 },
        {     0.000000,     0.000000,     0.000000 },
        {     0.000000,     0.000000,     0.000000 },
        {     0.000000,     0.000000,     0.000000 },
        {     0.000000,     0.000000,     0.000000 },
        {     0.000000,     0.000000,     0.000000 },
        {     0.000000,     0.000000,     0.000000 },
        {     0.000000,     0.000000,     0.000000 },
        {     0.000000,     0.000000,     0.000000 },
        {     0.000000,     0.000000,     0.000000 },
        {     0.000000,     0.000000,     0.000000 },
        {     0.000000,     0.000000,     0.000000 },
        {     0.000000,     0.000000,     0.000000 },
        {     0.000000,     0.000000,     0.000000 },
        {     0.000000,     0.000000,     0.000000 },
        {     0.000000,     0.000000,     0.000000 },
        {     0.000000,     0.000000,     0.000000 },
        {     0.000000,     0.000000,     0.000000 },
        {     0.000000,     0.000000,     0.000000 },
        {     0.000000,     0.000000,     0.000000 },
        {     0.000000,     0.000000,     0.000000 },
        {     0.000000,     0.000000,     0.000000 },
        {     0.000000,     0.000000,     0.000000 },
        {     0.000000,     0.000000,     0.000000 },
        {     0.000000,     0.000000,     0.000000 },
        {     0.000000,     0.000000,     0.000000 },
        {     0.000000,     0.000000,     0.000000 },
        {     0.000000,     0.000000,     0.000000 },
        {     0.000000,     0.000000,     0.000000 },
        {     0.000000,     0.000000,     0.000000 },
        {     0.000000,     0.000000,     0.000000 },
        {     0.000000,     0.000000,     0.000000 },
        {     0.000000,     0.000000,     0.000000 }
    }
};

AWB_CCM_S g_stAwbCcm = {
    .u16CCMTabNum = 4,
    .astCCMTab = {
        {
            .u16ColorTemp = 0x17A4,
            .au16CCM = {
                0x01BD, 0x80A3, 0x801A,
                0x806A, 0x01E3, 0x8079,
                0x8022, 0x80E2, 0x0204
            }
        },
        {
            .u16ColorTemp = 0x132C,
            .au16CCM = {
                0x01C2, 0x80A8, 0x801A,
                0x8074, 0x01D2, 0x805E,
                0x802B, 0x8128, 0x0253
            }
        },
        {
            .u16ColorTemp = 0xE93,
            .au16CCM = {
                0x01DF, 0x80D6, 0x8009,
                0x8085, 0x01CF, 0x804A,
                0x8027, 0x811A, 0x0241
            }
        },
        {
            .u16ColorTemp = 0xA48,
            .au16CCM = {
                0x0184, 0x805B, 0x8029,
                0x80BC, 0x0207, 0x804B,
                0x8094, 0x8242, 0x03D6
            }
        },
        {
            .u16ColorTemp = 0,
            .au16CCM = { 0, 0, 0, 0, 0, 0, 0, 0, 0 }
        },
        {
            .u16ColorTemp = 0,
            .au16CCM = { 0, 0, 0, 0, 0, 0, 0, 0, 0 }
        },
        {
            .u16ColorTemp = 0,
            .au16CCM = { 0, 0, 0, 0, 0, 0, 0, 0, 0 }
        }
    }
};

HI_U16 g_stDngColorParam[] = {
    0x17A, 0x100, 0x1AE,
    0x1B7, 0x100, 0x1B7
};

HI_U16 g_au16InitCCM[9 * VI_PIPE_SIZE]; // 36
HI_U16 g_au16InitWBGain[3 * VI_PIPE_SIZE]; // 12
HI_U16 g_au16SampleRgain[VI_PIPE_SIZE];
HI_U16 g_au16SampleBgain[VI_PIPE_SIZE];
HI_U32 g_au32LinesPer500ms[VI_PIPE_SIZE];
HI_U32 g_au32InitExposure[VI_PIPE_SIZE];

HI_U32 analog_gain_table[29] = {
    0x00400, 0x004CE, 0x05A0, 0x006C2, 0x007F0, 0x0094C, 0x00B40,
    0x00D84, 0x00FF0, 0x12C0, 0x01690, 0x01A68, 0x01F80, 0x0251C,
    0x02D20, 0x03520, 0x3F04, 0x049E0, 0x05800, 0x0699C, 0x07E54,
    0x09570, 0x0B220, 0x0D298, 0xF918, 0x12C50, 0x1688C, 0x1A968,
    0x1E2B0
};

HI_U32 regValTable[116] = {
    0x00, 0x00, 0x01, 0x00, 0x00, 0x10, 0x01, 0x0C,
    0x00, 0x20, 0x01, 0x1B, 0x00, 0x30, 0x01, 0x2C,
    0x00, 0x40, 0x01, 0x3F, 0x00, 0x50, 0x02, 0x16,
    0x00, 0x60, 0x02, 0x35, 0x00, 0x70, 0x03, 0x16,
    0x00, 0x80, 0x04, 0x02, 0x00, 0x90, 0x04, 0x31,
    0x00, 0xA0, 0x05, 0x32, 0x00, 0xB0, 0x06, 0x35,
    0x00, 0xC0, 0x08, 0x04, 0x00, 0x5A, 0x09, 0x19,
    0x00, 0x83, 0x0B, 0x0F, 0x00, 0x93, 0x0D, 0x12,
    0x00, 0x84, 0x10, 0x00, 0x00, 0x94, 0x12, 0x3A,
    0x01, 0x2C, 0x1A, 0x02, 0x01, 0x3C, 0x1B, 0x20,
    0x00, 0x8C, 0x20, 0x0F, 0x00, 0x9C, 0x26, 0x07,
    0x02, 0x64, 0x36, 0x21, 0x02, 0x74, 0x37, 0x3A,
    0x00, 0xC6, 0x3D, 0x02, 0x00, 0xDC, 0x3F, 0x3F,
    0x02, 0x85, 0x3F, 0x3F, 0x02, 0x95, 0x3F, 0x3F,
    0x00, 0xCE, 0x3F, 0x3F
};

ISP_CMOS_DPC_S g_stCmosDpc;                      // 0x2000
ISP_CMOS_LSC_S g_stCmosLsc;                      // 0x2040
ISP_CMOS_ANTIFALSECOLOR_S g_stIspAntiFalseColor; // 0x685c
ISP_CMOS_BAYERNR_S g_stIspBayerNr;               // 0x6880
ISP_CMOS_CA_S g_stIspCA;                         // 0x69cc
ISP_CMOS_CLUT_S g_stIspCLUT;                     // 0x6af0
ISP_CMOS_DRC_S g_stIspDRC;                       // 0xc110
ISP_CMOS_DEHAZE_S g_stIspDehaze;                 // 0xc328
ISP_CMOS_DEMOSAIC_S g_stIspDemosaic;             // 0xc338
ISP_CMOS_DETAIL_S g_stIspDetail;                 // 0xc37c
ISP_CMOS_EDGEMARK_S g_stIspEdgeMark;             // 0xc410
ISP_CMOS_GAMMA_S g_stIspGamma;                   // 0xc41c
ISP_CMOS_GE_S g_stIspGe;                         // 0xcc20
ISP_CMOS_HLC_S g_stIspHlc;                       // 0xcc88
ISP_CMOS_LDCI_S g_stIspLdci;                     // 0xcc90
ISP_CMOS_WDR_S g_stIspWDR;                       // 0xcd18
ISP_CMOS_SHARPEN_S g_stIspYuvSharpen;            // 0xcd64
ISP_CMOS_PREGAMMA_S g_stPreGamma;                // 0xd93c

HI_U32 g_fd[4];

ISP_SNS_OBJ_S stSnsGc2053Obj = {
    .pfnRegisterCallback    = sensor_register_callback,
    .pfnUnRegisterCallback  = sensor_unregister_callback,
    .pfnSetBusInfo          = gc2053_set_bus_info,
    .pfnSetBusExInfo        = HI_NULL,
    .pfnStandby             = gc2053_standby,
    .pfnRestart             = gc2053_restart,
    .pfnMirrorFlip          = gc2053_mirror_flip,
    .pfnWriteReg            = gc2053_write_register,
    .pfnReadReg             = gc2053_read_register,
    .pfnSetInit             = sensor_set_init
};

extern HI_U8  gc2053_i2c_addr;
extern HI_U32 gc2053_addr_byte;
extern HI_U32 gc2053_data_byte;


HI_VOID
cmos_get_inttime_max(VI_PIPE ViPipe, HI_U16 u16ManRatioEnable, HI_U32 *au32Ratio, HI_U32 *au32IntTimeMax, HI_U32 *au32IntTimeMin, HI_U32 *pu32LFMaxIntTime)
{}

HI_S32
gc2053_set_bus_info(VI_PIPE ViPipe, ISP_SNS_COMMBUS_U unSNSBusInfo)
{
    g_aunGc2053BusInfo[ViPipe] = unSNSBusInfo;
